[
  {
    "name": "Who Is Javier Bustos?",
    "handle": "who-is-javier-bustos",
    "date": "1-8-2025",
    "body_html": "<p><em>AI GENERATED POST - TEMPORARY PLACEHOLDER!</em></p>\n<h2>My Journey So Far: From IT Student to Systems Administrator</h2>\n<p>My path into IT started at <strong>Texas State Technical College</strong>, where I pursued an Associate of Applied Science in Cybersecurity Technology. While studying, I wasn’t just focused on theory—I wanted real-world exposure as early as possible. I was learning the fundamentals of systems, security, and networking, but I knew experience would be the real differentiator once I entered the field. That mindset pushed me to start working in IT before I had even finished school.</p>\n<h2>Getting Started at Contigo Technology</h2>\n<p>While still enrolled, I landed my first IT role at <strong>Contigo Technology</strong> as a <strong>PC Setup Technician</strong>. This was my introduction to professional IT environments and end-user support. I spent my days configuring and deploying workstations, installing RMM tools, antivirus software, and company-specific applications, and working with Active Directory and Office 365 to set up user accounts. It was hands-on, fast-paced, and foundational—exactly what I needed early in my career.</p>\n<p><img alt=\"Me at Contigo Technology during my first IT role\" src=\"/images/me-at-contigo.jpg\" /></p>\n<p>That role quickly evolved into <strong>Help Desk Technician I</strong> and later <strong>Help Desk Technician II</strong>, where I handled a wide range of hardware, software, and networking issues. I supported users remotely and on-site, documented solutions, assisted Tier 1 technicians, and became the primary technician for a multi-location healthcare client. This period shaped how I troubleshoot problems, communicate with users, and think through issues methodically under pressure.</p>\n<h2>Growing Into Enterprise IT at Texas Health and Human Services</h2>\n<p>After gaining solid experience in managed services, I transitioned to <strong>Texas Health and Human Services Commission</strong> as a <strong>Deskside Support Technician</strong>. This role exposed me to large-scale, enterprise environments with stricter processes, SLAs, and operational standards. I supported users across the agency, handled device deployments, managed inventory, and acted as Tier 2 support for more complex issues. Supporting everyone from frontline staff to executives sharpened both my technical and professional skills.</p>\n<p>I later advanced into my current role as a <strong>Systems Administrator III</strong>, where I now work in a senior technical capacity. My responsibilities include assisting with agency-wide device refreshes, maintaining system reliability, monitoring and resolving service tickets, performing system maintenance, and supporting disaster recovery planning. This role represents a shift from purely reactive support into more systems-focused, operational responsibility.</p>\n<h2>Where I Am Now — and Where I’m Going</h2>\n<p>Today, my focus is on continuing that progression beyond traditional IT support into cloud and infrastructure engineering. Alongside my day-to-day role, I’ve built hands-on experience with AWS services and earned multiple cloud certifications to deepen my understanding of scalable, secure systems. My long-term goal is to move into a cloud engineering or solutions architecture role, where I can design and automate infrastructure instead of just maintaining it.</p>\n<p>This blog documents that journey—what I’ve learned, what I’m building, and how I’m intentionally moving toward higher-impact work in cloud and infrastructure.</p>"
  },
  {
    "name": "Hello World!",
    "handle": "hello-world",
    "date": "1-7-2025",
    "body_html": "<h2>Hello World!</h2>\n<p>This is my <strong>first</strong> blog post. I promise more is coming soon!</p>"
  }
]